billing_cf/Documents/энргРегистрацияПоказанийАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРегистрацияПоказанийАбонента</Name>
			<BasedOn>
				<xr:Item>Document.энргПриходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныйОбъемПриборов</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьэнргИндивидуальныйОбъемДляОДН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаДанныхИзВнешнихИсточников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргМассовыйВводПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

billing_cf/Documents/энргРегистрацияПоказанийАбонента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);		
КонецПроцедуры

// Проверяет необходимо ли скорректировать связанные документы.
//
// Параметры:
//  ДокументОснование	-	ДокументСсылка.энргЗагрузкаПоказанийИзВнешнихИсточников, ДокументСсылка.энргЗагрузкаДанныхИзВнешнихИсточников, 
//  						ДокументСсылка.энргПлатежноеПоручениеВходящие, ДокументСсылка.энргОбходнойЛист, ДокументСсылка.энргПриходныйКассовыйОрдер, 
//  						ДокументСсылка.энргМассовыйВводПоказаний.
// 
//  ЗависимыеРеквизиты	-	Структура	-	см Документ.энргЗагрузкаДанныхИзВнешнихИсточников.ПолучитьЗависимыеРеквизиты.
// 
// Возвращаемое значение:
//   Булево.
//
Функция НеобходимоСкорректироватьСвязанныеДокументы(ДокументОснование, ЗависимыеРеквизиты) Экспорт 

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И НЕ энргРегистрацияПоказанийАбонента.Дата = &Дата
		|	И энргРегистрацияПоказанийАбонента.Проведен";
	
	Запрос.УстановитьПараметр("Дата", ЗависимыеРеквизиты.Дата);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Получает дату от связанных документов показаний.
//
// Параметры:
//  ДокументОснование		-	ДокументСсылка.энргЗагрузкаПоказанийИзВнешнихИсточников, ДокументСсылка.энргЗагрузкаДанныхИзВнешнихИсточников, 
//  							ДокументСсылка.энргПлатежноеПоручениеВходящие, ДокументСсылка.энргОбходнойЛист, ДокументСсылка.энргПриходныйКассовыйОрдер, 
//  							ДокументСсылка.энргМассовыйВводПоказаний.
//  ТекущаяДатаДокумента	-	Дата.
// 
// Возвращаемое значение:
//   Дата.
//
Функция ПолучитьДатуОтСвязанныхДокументовПоказаний(ДокументОснование, ТекущаяДатаДокумента) Экспорт 
	
	Результат = ТекущаяДатаДокумента;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргРегистрацияПоказанийАбонента.Дата КАК Дата
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И энргРегистрацияПоказанийАбонента.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.Дата;
	
	Возврат Результат;
	
КонецФункции

// Проверяет есть ли созданные регистрации показаний от документа основания.
//
// Параметры:
//  ДокументОснование	-	ДокументСсылка.энргЗагрузкаПоказанийИзВнешнихИсточников, ДокументСсылка.энргЗагрузкаДанныхИзВнешнихИсточников, 
//  						ДокументСсылка.энргПлатежноеПоручениеВходящие, ДокументСсылка.энргОбходнойЛист, ДокументСсылка.энргПриходныйКассовыйОрдер, 
//  						ДокументСсылка.энргМассовыйВводПоказаний.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЕстьСозданныеРегистрацииПоказанийОтДокументаОснования(ДокументОснование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	энргРегистрацияПоказанийАбонента.Дата КАК Дата
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И НЕ энргРегистрацияПоказанийАбонента.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);	
	РезультатЗапроса = Запрос.Выполнить();
	Результат = НЕ РезультатЗапроса.Пустой();
	
	Возврат Результат; 	
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Документы.энргПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании);  	
		
КонецПроцедуры

Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт 
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.энргРегистрацияПоказанийАбонента) Тогда
		КомандаСоздатьНаОсновании 					= КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор 	= Метаданные.Документы.энргРегистрацияПоказанийАбонента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление 	= НСтр("ru = 'Регистрация показаний'");
		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса  	= Новый Структура;
	Схема 				= Неопределено;
	
	ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры);
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);	
	ПричиныОтклоненияИсключая 		= Новый Массив;//энргРаботаСПоказаниямиПриборовУчетаСервер.ПричиныОтклоненияИсключая();
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", ДокументСсылка);
	ПараметрыПроведения = ДополнительныеСвойства.ПараметрыПроведения;
	ПараметрыЗапроса.Вставить("ПричиныОтклоненияИсключая",ПричиныОтклоненияИсключая);
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

Процедура УстановитьЗависимыеРеквизитыОтДокументаОснования(ДокументОснование, ЗависимыеРеквизиты, Контекст = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(1, "Корректировка документов показаний");
	
	ЗависимыеПоляПерезаписиПоУмолчанию = "Дата,ПериодНачисления";
	ЗависимыеПоляПерезаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст, "ЗависимыеПоляПерезаписи", ЗависимыеПоляПерезаписиПоУмолчанию);
	
	ПовторноеПроведение = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка,
	|	энргРегистрацияПоказанийАбонента.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
	|ГДЕ
	|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
	|	И энргРегистрацияПоказанийАбонента.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Скорректировано показаний " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли;
		
		УстановитьЗависимыеРеквизиты(Выборка.Ссылка, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи, ПовторноеПроведение);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторноеПроведение Цикл 
		УстановитьЗависимыеРеквизиты(ДокументСсылка, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи, ПовторноеПроведение)
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиДокументыПоДокументуОснованию(ДокументОснование) Экспорт
	 
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ПовторноеПроведение = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка,
	|	энргРегистрацияПоказанийАбонента.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
	|ГДЕ
	|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
	|	И НЕ энргРегистрацияПоказанийАбонента.Проведен
	|	И НЕ энргРегистрацияПоказанийАбонента.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Проведено " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли;
		
		ПровестиДокумент(Выборка.Ссылка, ПовторноеПроведение);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторноеПроведение Цикл 
		ПровестиДокумент(ДокументСсылка);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОтменитьПроведениеДокументовПоДокументуОснованию(ДокументОснование) Экспорт 

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ПовторнаяОтмена = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка,
		|	энргРегистрацияПоказанийАбонента.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И энргРегистрацияПоказанийАбонента.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Отменено " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли; 		
		
		ОтменитьПроведениеДокумента(Выборка.Ссылка, ПовторнаяОтмена);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
				
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторнаяОтмена Цикл 
		ОтменитьПроведениеДокумента(ДокументСсылка);
	КонецЦикла; 	
	
КонецПроцедуры

Процедура УстановитьПометкуУдаленияПоказанийПоДокументуОснованию(ДокументОснование, ПризнакПометки = Истина) Экспорт 

	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда 
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(1, "Отмена документов показаний");
	
	ПовторнаяОтмена = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргРегистрацияПоказанийАбонента.Ссылка КАК Ссылка,
		|	энргРегистрацияПоказанийАбонента.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.энргРегистрацияПоказанийАбонента КАК энргРегистрацияПоказанийАбонента
		|ГДЕ
		|	энргРегистрацияПоказанийАбонента.ДокументОснование = &ДокументОснование
		|	И НЕ энргРегистрацияПоказанийАбонента.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Всего = Выборка.Количество();
	Счетчик = 0;
	КоличествоИтераций = Счетчик;
	КолвоСообщений = Цел(Всего / 15);
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			Процент = Цел(Счетчик / Всего * 100);
			ДлительныеОперации.СообщитьПрогресс(Процент, "Отменено документов показаний " + Счетчик + " из " + Всего);
			КоличествоИтераций = 0;
		КонецЕсли; 		
		
		УстановитьПометкуУдаленияПоказаний(Выборка.Ссылка, ПовторнаяОтмена, ПризнакПометки);
		
		Счетчик = Счетчик + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
				
	КонецЦикла;	
	
	Для Каждого ДокументСсылка из ПовторнаяОтмена Цикл 
		УстановитьПометкуУдаленияПоказаний(ДокументСсылка,, ПризнакПометки);
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаПоказанияПриборовУчета(Схема, Регистры) 
	
	ИмяРегистра 	= "энргПоказанияПриборовУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  		= 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ТаблицаПоказанияПриборовУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	0 КАК Разделитель,
	|	ВЫБОР
	|		КОГДА энргПриборыУчетаАбонента.РегистрируетОбъем
	|			ТОГДА ТаблицаПоказанияПриборовУчета.Разница
	|		ИНАЧЕ ТаблицаПоказанияПриборовУчета.ТекущиеПоказания
	|	КОНЕЦ КАК Показание,
	|	ТаблицаПоказанияПриборовУчета.СостояниеПоказаний КАК СостояниеПоказаний,
	|	ВложенныйЗапрос.ИсточникПоказаний = ЗНАЧЕНИЕ(Справочник.энргИсточникиПоказаний.КонтрольныйСъем) КАК КС,
	|	ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний,
	|	ТаблицаПоказанияПриборовУчета.Переворот КАК Переворот,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаПоказанияПриборовУчета.НомерСтроки КАК НомерСтрокиТЧ,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаПоказанияПриборовУчета.ПричинаОтклонения КАК ПричинаОтклонения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.ИсточникПоказаний КАК ИсточникПоказаний,
	|		ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВложенныйЗапрос.ПериодРегистрации КАК ПериодРегистрации,
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.IDСтрокиТочкиУчета КАК IDСтрокиТочкиУчета,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ТаблицаШкалы.IDСтроки КАК IDСтроки,
	|		ТаблицаШкалы.Шкала КАК Шкала
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Шапка.Дата КАК Период,
	|			Шапка.Организация КАК Организация,
	|			Шапка.Район КАК Район,
	|			Шапка.ИсточникПоказаний КАК ИсточникПоказаний,
	|			Шапка.КлючПомещения КАК КлючПомещения,
	|			ТаблицаТочки.ТочкаУчета КАК ТочкаУчета,
	|			ТаблицаТочки.ПриборУчета КАК ПриборУчета,
	|			ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод) КАК Состояние,
	|			Шапка.Дата КАК ПериодРегистрации,
	|			Шапка.ПериодНачисления КАК ПериодНачисления,
	|			ТаблицаТочки.IDСтроки КАК IDСтрокиТочкиУчета,
	|			Шапка.Ссылка КАК Регистратор
	|		ИЗ
	|			Документ.энргРегистрацияПоказанийАбонента КАК Шапка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ТочкиУчета КАК ТаблицаТочки
	|				ПО Шапка.Ссылка = ТаблицаТочки.Ссылка
	|					И (Шапка.Ссылка В (&мДокументы))
	|					И (ТаблицаТочки.Ссылка В (&мДокументы))
	|					И (НЕ ТаблицаТочки.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ШкалыПриборовУчета КАК ТаблицаШкалы
	|			ПО ВложенныйЗапрос.Регистратор = ТаблицаШкалы.Ссылка
	|				И ВложенныйЗапрос.IDСтрокиТочкиУчета = ТаблицаШкалы.IDСтрокиТочкиУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРегистрацияПоказанийАбонента.ПоказанияПриборовУчета КАК ТаблицаПоказанияПриборовУчета
	|		ПО ВложенныйЗапрос.Регистратор = ТаблицаПоказанияПриборовУчета.Ссылка
	|			И ВложенныйЗапрос.IDСтроки = ТаблицаПоказанияПриборовУчета.IDСтроки
	//|			И (ВЫБОР
	//|				КОГДА ТаблицаПоказанияПриборовУчета.СтатусИзмененПользователем
	//|						ИЛИ ТаблицаПоказанияПриборовУчета.ПереворотИзмененПользователем
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ НЕ ТаблицаПоказанияПриборовУчета.ПричинаОтклонения В (&ПричиныОтклоненияИсключая)
	//|			КОНЕЦ)
	|			И (ТаблицаПоказанияПриборовУчета.ПоказанияПредоставлены)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|		ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка"; 	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура УстановитьЗависимыеРеквизиты(ДокументСсылка, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи, ПовторнаяЗапись = Неопределено)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ДокОбъект, ЗависимыеРеквизиты, ЗависимыеПоляПерезаписи);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПровестиДокумент(ДокументСсылка, ПовторнаяЗапись = Неопределено)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтменитьПроведениеДокумента(ДокументСсылка, ПовторнаяЗапись = Неопределено)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
		КонецЕсли;
		
	КонецПопытки; 	
	
КонецПроцедуры

Процедура УстановитьПометкуУдаленияПоказаний(ДокументСсылка, ПовторнаяЗапись = Неопределено, ПризнакПометки = Истина)
	
	Попытка
		
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(ПризнакПометки);		
			
	Исключение
		
		Если НЕ ПовторнаяЗапись = Неопределено Тогда 
			ПовторнаяЗапись.Добавить(ДокументСсылка);
		КонецЕсли;
		
	КонецПопытки; 	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
